Fix figures
